{
    "action": {
        "common": {
            "cancel": "İptal",
            "send": "Gönder",
            "okay": "Tamam",
            "logOut": "Çıkış Yap"
        },
        "auth": {
            "setup": "Kur",
            "join": "Katıl",
            "changeToSetup": "Henüz bir odan yokmu? Hemen bir tane kur!",
            "changeToJoin": "Zaten bir odan varmı? Katıl!"
        },
        "room": {
            "download": "İndir",
            "upload": "Yükle"
        }
    },
    "message": {
        "common": {
            "cannotBeNull": "{{field}} doldurulmalıdır",
            "minCharacter": "{{field}} en az {{length}} karakter uzunluğunda olmalı",
            "maxCharacter": "{{field}} {{length}} karakter uzunluğunu geçemez",
            "mustBeAlphaNumeric": "{{field}} sayı ve harflerden oluşmalıdır özel karakter içeremez",
            "notFound": "Verilen bilgiler ile eşleşen bir oda bulamadık",
            "unexpected": "Beklenmedik sunucu hatası. Lütfen daha sonra deneyin."
        },
        "auth": {
            "join": "Bir odaya katıl",
            "setup": "Yeni bir oda kur"
        },
        "room": {
            "hostNotProvidedAnyFile": "Oda sahibi henüz dosya paylaşımında bulunmadı",
            "hostNotOnline": "Oda sahibi aktif değil",
            "upload": "Dosyaları oda sahibine yüklemek için sürükle bırak yada seç"
        }
    },
    "title": {
        "common": {
            "fson": "fson Ağ Üzerinden Dosya Paylaşımı",
            "error": "Bir hata meydana geldi",
            "room": "Oda",
            "downloads": "İndirmeler",
            "settings": "Ayarlar",
            "language": {
                "change": "Dili değiştir",
                "english": "English",
                "turkish": "Türkçe"
            }
        },
        "auth": {
            "roomCode": "Oda Kodu",
            "password": "Şifre"
        },
        "room": {
            "fileName": "Dosya Adı",
            "fileSize": "Boyutu"
        }
    },
    "pages": {
        "main": {
            "about": "'FSON' aynı ağ üzerindeki cihazların yerel ağ üzerinden HTTP protokolü kullanarak dosya aktarımı yapmasını sağlayan bir açık kaynak projesi. Bu proje, UNIX/Windows işletim sistemi yüklü bir ev sahibi makine üzerinden alıcı cihazlar ve ev sahibi arasında dosya aktarımını mümkün kılıyor. Kullanıcılar, projenin web sitesi araçlığıyla var olan bir odaya katılabilir ya da yeni bir oda oluşturabilirler. Oluşturulan odaya bir host bilgisayar masaüstü yazılımı ile bağlanır ve ilgili kayıtlar yapıldıktan sonra odaya katılan mobil ve masaüstü konaklar host bilgisayar ile 2 yönlü dosya aktarımı yaparlar. Projenin temel amacı, aynı özel ağda bulunan cihazların host bilgisayarda sunulan web uygulaması ile HTTP protokolü vasıtasıyla hızlı dosya aktarımını mümkün kılmaktır. Bu proje, çeşitli teknolojilerin beraber kullanıldığı bir proje olduğundan platformlar arası çeşitli teknolojilerin beraber kullanıldığı bir projede sürekli geliştirme ve entegrasyon süreçleri hakkında tecrübe edinilmesi hedefleniyor.",
            "projectPage": "Proje sayfasına buradan ulaşabilirsiniz her türlü yardımı hoş karşılarım."
        }
    }
}